def roco_evolution() :
    evo = {'039'            : '挖三次矿石' ,
           '矿晶虫'         : '挖三次矿石' ,
           'kuangjingchong' : '挖三次矿石' ,
           'kjc'            : '挖三次矿石' ,
           '060'            : '32级，击败3虫' ,
           '伏地兽'         : '32级，击败3虫' ,
           'fudishou'       : '32级，击败3虫' ,
           'fds'            : '32级，击败3虫' ,
           '082'            : '38级，雌性' ,
           '一窝蜂'         : '38级，雌性' ,
           'yiwofeng'       : '38级，雌性' ,
           'ywf'            : '38级，雌性' ,
           '085'            : '44级，雌性' ,
           '小夜'           : '44级，雌性' ,
           'xiaoye'         : '44级，雌性' ,
           'xy'             : '44级，雌性' ,
           '091'            : '40级前，改恶系血脉' ,
           '黑羽夫人'       : '40级前，改恶系血脉' ,
           'heiyufuren'     : '40级前，改恶系血脉' ,
           'hyfr'           : '40级前，改恶系血脉' ,
           '099'            : '36级，雌性' ,
           '小草虫'         : '36级，雌性' ,
           'xiaocaochong'   : '36级，雌性' ,
           'xcc'            : '36级，雌性' ,
           '150'            : '40级，2星' ,
           '里奥'           : '40级，2星' ,
           'liao'           : '40级，2星' ,
           'la'             : '40级，2星' ,
           '174'            : '48级，雨天' ,
           '菇菇丁'         : '48级，雨天' ,
           'guguding'       : '48级，雨天' ,
           'ggd'            : '48级，雨天' ,
           }

    while 1 :
        a = input('查阅进化方式请输入精灵昵称(三位编号/昵称全拼/昵称缩写):')
        if a in evo :
            print(evo[a])
            break
        else :
            print('输入错误，请重新输入')


while 1 :
    roco_evolution()
    mm = input('按任意键继续，仅按enter以结束')
    if mm == '' :
        print('---运行结束---')
        break
